---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.DetailLevel
source: html/29f3a6bf-aa33-8b8e-4e32-118e8bb71a34.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.DetailLevel Property

Identifies the level of detail in which the Bending Detail will be represented.

## Syntax (C#)
```csharp
public BendingDetailLevelOfDetail DetailLevel { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration